import './home.css'
import Section from '../../style/mui/styled/Section'
import Grid from '../../style/vanilla/Grid'
import { Paper, Typography, useTheme } from '@mui/material'
import { FlexColumn, FlexRow } from '../../style/mui/styled/Flexbox'
import Image from '../ui/Image'




const features = [
    {
        icon: <svg xmlns="http://www.w3.org/2000/svg" width="150" height="150" viewBox="0 0 48 48"><g fill="none" strokeWidth="3"><path fill="#8fbffa" d="M39.743 44.461c2.555-.208 4.51-2.163 4.718-4.718C44.723 36.515 45 31.364 45 24s-.277-12.515-.539-15.743c-.208-2.555-2.163-4.51-4.718-4.718C36.515 3.277 31.364 3 24 3s-12.515.277-15.743.539c-2.555.208-4.51 2.163-4.718 4.718C3.277 11.485 3 16.636 3 24s.277 12.515.539 15.743c.208 2.555 2.163 4.51 4.718 4.718C11.485 44.723 16.636 45 24 45s12.515-.277 15.743-.539" /><path fill="#fff" fillRule="evenodd" d="M31.659 34.651a3.72 3.72 0 0 1-4.973.525a181 181 0 0 1-4.941-3.73a.98.98 0 0 0-1.402.184c-1.126 1.552-2.378 3.507-3.384 5.137c-1.174 1.9-3.487 2.876-5.345 1.636a12 12 0 0 1-1.323-1.021c-1.577-1.395-1.414-3.735-.047-5.335c2.15-2.517 4.727-5.362 7.225-7.79c1.458-1.417 3.752-1.366 5.274-.017c1.521 1.348 3.428 2.987 4.957 4.138a.95.95 0 0 0 1.274-.116c1.721-1.853 4.116-4.704 5.619-6.52c.916-1.108 2.286-1.858 3.51-1.104c.29.18.571.387.824.61c.947.838.778 2.193.143 3.286c-1.212 2.087-3.635 5.874-7.411 10.117" clipRule="evenodd" /><path stroke="#2859c5" strokeLinecap="round" strokeLinejoin="round" d="M39.743 44.461c2.555-.208 4.51-2.163 4.718-4.718C44.723 36.515 45 31.364 45 24s-.277-12.515-.539-15.743c-.208-2.555-2.163-4.51-4.718-4.718C36.515 3.277 31.364 3 24 3s-12.515.277-15.743.539c-2.555.208-4.51 2.163-4.718 4.718C3.277 11.485 3 16.636 3 24s.277 12.515.539 15.743c.208 2.555 2.163 4.51 4.718 4.718C11.485 44.723 16.636 45 24 45s12.515-.277 15.743-.539" /><path stroke="#2859c5" strokeLinecap="round" strokeLinejoin="round" d="M31.66 34.652a3.72 3.72 0 0 1-4.974.524a181 181 0 0 1-4.94-3.73a.98.98 0 0 0-1.402.184c-1.127 1.552-2.378 3.507-3.385 5.137c-1.173 1.9-3.487 2.876-5.344 1.636a12 12 0 0 1-1.324-1.021c-1.576-1.395-1.414-3.735-.046-5.335c2.15-2.517 4.727-5.362 7.224-7.79c1.459-1.417 3.752-1.366 5.274-.017c1.522 1.348 3.428 2.987 4.958 4.138a.95.95 0 0 0 1.274-.116c1.72-1.853 4.115-4.704 5.618-6.52c.917-1.107 2.286-1.858 3.51-1.104c.29.18.572.387.824.61c.947.838.778 2.193.143 3.286c-1.212 2.087-3.635 5.874-7.41 10.118" clipRule="evenodd" /><path stroke="#2859c5" strokeLinecap="round" strokeLinejoin="round" d="M11 11h10m-10 6h6" /></g></svg>,
        // icon: <Image img={'/assets/questions.svg'} sx={{ maxWidth: '150px' }} />,
        title: 'بنك الاسئله',
        body: " المنصه بتقدملك بنك اسئله بتقدر تختار الدروس اللي تمتحن عليها وتختار عدد الاسئله وكمان الاسئله اللي بتحلها تقدر ترجعلها فى اى وقت او حتى تجيب الاسئله اللي غلطت فيها بكل سهوله"
    },
    {
        icon: <Image img={'/assets/plan.svg'} sx={{ maxWidth: '150px' }} borderRadius='0' />,
        title: "خطه مذاكره ومتابعه",
        body: "بنعملك جدول مذاكره ومتابعه كمان عشان تقدر تقوى نفسك فى الدروس الصعبه او تقدر تحقق اقصي استفاده وباقل مجهود"
    },
    {
        // icon: <Image img={'/assets/time.svg'} sx={{ maxWidth: '150px' }} />,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width={150} height={150} viewBox="0 0 24 24"><g fill="none"><path fill="#ffbc44" d="M18.312 13.82a4.49 4.49 0 0 0 2.252-3.976a6.33 6.33 0 0 0-1.887-4.402a2.176 2.176 0 0 1-2.515 1.886a4.77 4.77 0 0 1-1.258-5.659c-3.93 0-6.445 2.319-6.916 5.66a2.31 2.31 0 0 1-2.516-1.887c-2.782 2.366-2.925 7.152.893 8.926"></path><path stroke="#191919" strokeLinecap="round" strokeLinejoin="round" d="M18.312 13.82a4.49 4.49 0 0 0 2.252-3.976a6.33 6.33 0 0 0-1.887-4.402a2.176 2.176 0 0 1-2.515 1.886a4.77 4.77 0 0 1-1.258-5.659c-3.93 0-6.445 2.319-6.916 5.66a2.31 2.31 0 0 1-2.516-1.887c-2.782 2.366-2.925 7.152.893 8.926" strokeWidth={1}></path><path fill="#66e1ff" d="M12.428 22.33a6.288 6.288 0 1 0 0-12.575a6.288 6.288 0 0 0 0 12.576"></path><path fill="#c2f3ff" d="M7.981 20.49a6.288 6.288 0 1 1 8.894-8.894z"></path><path stroke="#191919" strokeLinecap="round" strokeLinejoin="round" d="M12.428 22.33a6.288 6.288 0 1 0 0-12.575a6.288 6.288 0 0 0 0 12.576" strokeWidth={1}></path><path stroke="#191919" strokeLinecap="round" strokeLinejoin="round" d="M15.572 16.043h-3.144V12" strokeWidth={1}></path></g></svg>,
        title: 'الوقت',
        body: "فيديوهات متنظمه ومركزه بنتكلم فيها على ادق النقاط فى الدروس من غير تضييع للوقت وكمان فيه كورسات لكل الدروس و ممكن تسجل فى محاضره من غير ما تشتري الكورس"
    }, {
        icon: <svg xmlns="http://www.w3.org/2000/svg" width={150} height={150} viewBox="0 0 48 48"><g fill="none"><path fill="#8fbffa" d="M7.582 2.137C10.326 1.823 14.685 1.5 21 1.5a165 165 0 0 1 5.13.077a1.5 1.5 0 0 1 .4.068c1.098.343 4.029 1.564 8.123 5.578c3.862 3.787 5.195 6.563 5.63 7.781a1.5 1.5 0 0 1 .087.45c.045 1.224.081 2.561.104 4.019c-1.865-.126-3.58.777-4.662 1.86L22.23 34.913c-1.1 1.1-2.02 2.606-2.25 4.441c-.143 1.144-.274 2.798-.278 5.025l.001.115c-5.62-.04-9.57-.34-12.121-.632c-2.895-.33-5.094-2.531-5.413-5.431C1.843 35.478 1.5 30.57 1.5 23s.343-12.478.669-15.432c.32-2.9 2.518-5.1 5.413-5.431"></path><path fill="#2859c5" d="M40.348 15.25c-2.42-.001-6.57-.04-8.948-.268c-2.598-.249-4.641-2.321-4.896-4.975c-.214-2.233-.253-5.99-.254-8.421q.142.015.28.059c1.098.343 4.029 1.564 8.123 5.578c3.862 3.787 5.195 6.563 5.63 7.781q.043.12.065.246m5.09 15.994c.991-.992 1.423-2.42.706-3.625c-.447-.75-1.115-1.661-2.108-2.655s-1.905-1.661-2.655-2.108c-1.205-.717-2.633-.285-3.625.706L24.251 37.068c-.801.8-1.375 1.801-1.51 2.926c-.12 1-.233 2.46-.241 4.431a2.064 2.064 0 0 0 2.075 2.075c1.972-.008 3.431-.122 4.43-.242c1.126-.134 2.126-.708 2.928-1.509z"></path><path fill="#8fbffa" fillRule="evenodd" d="M43.469 33.212q-.12-.25-.273-.54c-.584-1.087-1.571-2.549-3.216-4.194c-1.559-1.559-2.952-2.527-4.02-3.12l-2.235 2.235c.175.076.39.177.642.312c.828.444 2.053 1.256 3.491 2.694c1.439 1.439 2.25 2.664 2.695 3.492c.222.415.354.733.427.931a3 3 0 0 1 .077.236q.035.143.093.273l.403-.403c-.488.11-.5.113-.5.114v-.002l.5-.112zm-2.412 2.046v.002zm-.003-.015l.002.01v-.003l-.002-.004z" clipRule="evenodd"></path><path fill="#2859c5" fillRule="evenodd" d="M19.017 7.576a1.75 1.75 0 0 1 .407 2.441l-5 7a1.75 1.75 0 0 1-2.661.22l-4-4a1.75 1.75 0 0 1 2.474-2.474l2.54 2.539l3.799-5.319a1.75 1.75 0 0 1 2.441-.407m0 11a1.75 1.75 0 0 1 .407 2.441l-5 7a1.75 1.75 0 0 1-2.661.22l-4-4a1.75 1.75 0 0 1 2.474-2.474l2.54 2.539l3.799-5.319a1.75 1.75 0 0 1 2.441-.407" clipRule="evenodd"></path></g></svg>,
        // icon: <Image img={'/assets/exam.svg'} sx={{ maxWidth: '150px' }} borderRadius='0'/>,
        title: 'امتحانات دوريه',
        body: 'امتحانات دوريه طبقا لاسئله النظام الجديد وبنوضحلك الاسئله بفيديو او حتى بشرح يفهمك الدنيا من غير متصعب وكمان بندربك على اسئله السنين السابقه'
    }, {
        // icon: <Image img={'/assets/contact.svg'} sx={{ maxWidth: '150px' }} />,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width={150} height={150} viewBox="0 0 40 40"><g fill="none" strokeMiterlimit={10}><path fill="#ffe236" stroke="#231f20" d="M37.78 11.93c.254-.577.39-1.2.4-1.83c1.4-.79 1.38-1.32 1.16-2s-.51-1.14-2.11-1a4.8 4.8 0 0 0-1.39-1.26c0-1.61-.45-1.86-1.16-2s-1.24-.14-1.9 1.34a4.8 4.8 0 0 0-1.78.57c-1.38-.82-1.83-.55-2.33 0s-.73 1 .21 2.31q-.184.437-.29.9q-.1.466-.11.94c-1.4.79-1.38 1.31-1.16 2s.52 1.14 2.12 1a4.8 4.8 0 0 0 1.38 1.26c0 1.61.45 1.86 1.16 2s1.24.13 1.9-1.35a4.8 4.8 0 0 0 1.78-.56c1.38.81 1.83.54 2.33 0s.73-1.01-.21-2.32Z" strokeWidth={1}></path><path fill="#fff" stroke="#231f20" d="M30.95 10a2.38 2.38 0 1 0 4.76 0a2.38 2.38 0 0 0-4.76 0Z" strokeWidth={1}></path><path fill="#48eeff" stroke="#231f20" d="M21.58 8.27a5.44 5.44 0 0 0-2.89-.84A12 12 0 0 0 18 5.32a1.89 1.89 0 0 0-3.52.68a7 7 0 0 0 0 1.5a34 34 0 0 0-3.59.45a36 36 0 0 0-3.51.85A7.7 7.7 0 0 0 7 7.35a1.84 1.84 0 0 0-2-1A1.81 1.81 0 0 0 3.4 8c-.034.739.006 1.48.12 2.21A5.46 5.46 0 0 0 1.12 12c-.55 1-.84 5-.24 8.31s2.3 6.96 3.17 7.69c1.34 1.12 7.35 1 10.64.35s9-2.58 9.82-4.1c.56-1 .84-5 .24-8.31S22.46 9 21.58 8.27Z" strokeWidth={1}></path><path fill="#fff" stroke="#231f20" d="M20.29 23c1.05-1 .88-2.57.36-5.45s-.95-4.44-2.27-5c-.73-.63-3.92-.24-6.53.24S6.11 14.1 5.66 15c-1 1-.89 2.57-.36 5.44s1 4.44 2.27 5c.73.64 3.91.24 6.53-.23s5.73-1.32 6.19-2.21Z" strokeWidth={1}></path><path stroke="#231f20" strokeLinecap="round" d="M9.7 15s.16 1.82.65 4.5s1 4.44 1 4.44m4.9-.94s-.16-1.82-.65-4.5s-1-4.44-1-4.44" strokeWidth={1}></path><path stroke="#231f20" strokeLinecap="round" d="M18 15.91s-2.22.16-5.47.76q-2.716.48-5.37 1.23m.77 4.19s2.21-.16 5.47-.76s5.39-1.23 5.39-1.23" strokeWidth={1}></path><path stroke="#fff" strokeLinecap="round" d="M18.35 9.08c2.44.23 2.32.62 2.81 1.49" strokeWidth={1}></path><path fill="#ff52a1" stroke="#231f20" d="M18.04 28.32a10.4 10.4 0 1 0 20.8 0a10.4 10.4 0 0 0-20.8 0Z" strokeWidth={1}></path><path fill="#fff" stroke="#231f20" d="M21.51 28.32a6.93 6.93 0 1 0 13.86 0a6.93 6.93 0 0 0-13.86 0Z" strokeWidth={1}></path><path fill="#ff52a1" stroke="#231f20" d="M29.26 27.83c.17-2.15-.24-3.71-.9-3.77s-1.28.86-1.45 2.94c-.21 2.61.87 3.12 2.62 3.27s2.9-.3 2.95-1s-.59-1.27-3.22-1.44Z" strokeWidth={1}></path><path stroke="#fff" strokeLinecap="round" d="M33.33 20.83a4.3 4.3 0 0 1 2.4 2" strokeWidth={1}></path><path fill="#ffe236" stroke="#231f20" strokeLinecap="round" d="M10.04 34.36a1.88 1.88 0 1 0 3.76 0a1.88 1.88 0 0 0-3.76 0ZM22.44 2.9a1.64 1.64 0 1 0 3.28 0a1.64 1.64 0 0 0-3.28 0Z" strokeWidth={1}></path></g></svg>,
        title: 'سهوله التواصل',
        body: "تقدر تتواصل مع المستر بكل سهوله لو فيه نقطه مش فاهمها"
    }, {
        // icon: <Image img={'/assets/contact-24.svg'} sx={{ maxWidth: '150px', backgroundColor: 'primary.main' }} />,
        icon: <svg xmlns="http://www.w3.org/2000/svg" width={150} height={150} viewBox="0 0 24 24"><g fill="none" stroke="currentColor" strokeLinecap="round" strokeLinejoin="round" strokeWidth={2}><path strokeDasharray={64} strokeDashoffset={64} d="M8 3c0.5 0 2.5 4.5 2.5 5c0 1 -1.5 2 -2 3c-0.5 1 0.5 2 1.5 3c0.39 0.39 2 2 3 1.5c1 -0.5 2 -2 3 -2c0.5 0 5 2 5 2.5c0 2 -1.5 3.5 -3 4c-1.5 0.5 -2.5 0.5 -4.5 0c-2 -0.5 -3.5 -1 -6 -3.5c-2.5 -2.5 -3 -4 -3.5 -6c-0.5 -2 -0.5 -3 0 -4.5c0.5 -1.5 2 -3 4 -3Z"><animate fill="freeze" attributeName="stroke-dashoffset" dur="0.6s" values="64;0"></animate><animateTransform id="SVG3Jm2WHSS" fill="freeze" attributeName="transform" begin="0.6s;SVG3Jm2WHSS.begin+2.7s" dur="0.5s" type="rotate" values="0 12 12;15 12 12;0 12 12;-12 12 12;0 12 12;12 12 12;0 12 12;-15 12 12;0 12 12"></animateTransform></path><path strokeDasharray={4} strokeDashoffset={4} d="M15.76 8.28c-0.5 -0.51 -1.1 -0.93 -1.76 -1.24M15.76 8.28c0.49 0.49 0.9 1.08 1.2 1.72"><animate fill="freeze" attributeName="stroke-dashoffset" begin="SVG3Jm2WHSS.begin+0s" dur="2.7s" keyTimes="0;0.111;0.259;0.37;1" values="4;0;0;4;4"></animate></path><path strokeDasharray={6} strokeDashoffset={6} d="M18.67 5.35c-1 -1 -2.26 -1.73 -3.67 -2.1M18.67 5.35c0.99 1 1.72 2.25 2.08 3.65"><animate fill="freeze" attributeName="stroke-dashoffset" begin="SVG3Jm2WHSS.begin+0.2s" dur="2.7s" keyTimes="0;0.074;0.185;0.333;0.444;1" values="6;6;0;0;6;6"></animate></path></g></svg>,
        title: 'الدعم الفنى',
        body: 'دعم فنى 24 ساعه لو فيه مشكله قابلتك او حتى لو محتاج حاجه تقدر تتواصل مع الدعم ومتنساش تشاركنا اراءك واقتراحاتك من خلال المنصه , يلا سجل دلوقتى وابدا رحلتك!'
    },
]
const nuc = <svg className='rotate' xmlns="http://www.w3.org/2000/svg" width={40} height={40} viewBox="0 0 40 40"><g fill="none" strokeMiterlimit={10}><path fill="#ffe236" stroke="#231f20" d="M39.48 24.75a2.79 2.79 0 0 0-2.72-3.06c-.9 0-2 0-3.22.06c-.54 0-1.1.08-1.66.15a2.8 2.8 0 0 0-2.37 2.15a9.8 9.8 0 0 1-2.71 4.65a2.65 2.65 0 0 0-.67 2.95c.24.56.49 1.11.76 1.63a36 36 0 0 0 2 3.5a2.84 2.84 0 0 0 4.1.62c3.75-2.88 5.91-7.26 6.49-12.65Zm-29-.69a2.78 2.78 0 0 0-2.37-2.15c-.56-.07-1.12-.12-1.66-.15s-1.73-.08-3.21 0A2.8 2.8 0 0 0 .52 24.8c.59 5.4 2.76 9.77 6.5 12.65a2.83 2.83 0 0 0 4.08-.64a33 33 0 0 0 2-3.52c.27-.53.53-1.08.77-1.64a2.62 2.62 0 0 0-.68-2.94a9.9 9.9 0 0 1-2.71-4.65Zm2.83-21.28a2.8 2.8 0 0 0-1.75 4c.44.84 1 1.83 1.78 3c.27.42.57.84.87 1.25a2.84 2.84 0 0 0 3.05 1.12a9.6 9.6 0 0 1 5.48 0a2.84 2.84 0 0 0 3.05-1.12c.3-.41.59-.83.87-1.25s1-1.59 1.75-3a2.84 2.84 0 0 0-1.77-4A26 26 0 0 0 20 2a25.5 25.5 0 0 0-6.69.78Zm1.07 18.84a5.62 5.62 0 1 0 11.24 0a5.62 5.62 0 0 0-11.24 0Z" strokeWidth={1}></path><path stroke="#fff" strokeLinecap="round" d="M22.13 4.58a18.3 18.3 0 0 1 3.65.52m-5.05 13.4a2.34 2.34 0 0 1 2 2.18m11.54 3.58c.95-.14 2.37-.51 2.73.16m-31.82-.55c1.76-.09 2.14-.09 2.51.33" strokeWidth={1}></path></g></svg>
// const reactor = <svg xmlns="http://www.w3.org/2000/svg" width={100} height={100} viewBox="0 0 72 72"><path fill="#fff" d="M22.87 30.126c-.01 0-.02-.02-.02-.02a4.4 4.4 0 0 1-.52-.36c-.01-.01-.02-.01-.03-.02a6.1 6.1 0 0 1-1.83-2.6a6 6 0 0 1 3.16-7.51a3.977 3.977 0 0 1 6.76-2.13a5 5 0 0 1 2.72-2.41a4.92 4.92 0 0 1 3.28-.02a4.975 4.975 0 0 1 7.3-5.21a7.9 7.9 0 0 1 2.83-1.77a7.9 7.9 0 0 1 2.67-.48a5.9 5.9 0 0 1 2.03-1.23a6.003 6.003 0 0 1 7.69 3.58c.06.17.11.34.16.52q.285.047.56.14a3.95 3.95 0 0 1 2.53 2.42a4 4 0 0 1-2.39 5.12a3.94 3.94 0 0 1-2.91-.08a7.98 7.98 0 0 1-9.79 5.21a4.96 4.96 0 0 1-8.71 2.36a4.94 4.94 0 0 1-6.82 1.99a5.9 5.9 0 0 1-2.06 2.41"></path><path fill="#fff" d="M22.87 30.126c-.01 0-.02-.02-.02-.02a4.4 4.4 0 0 1-.52-.36c-.01-.01-.02-.01-.03-.02a6.1 6.1 0 0 1-1.83-2.6a6 6 0 0 1 3.16-7.51a3.977 3.977 0 0 1 6.76-2.13a5 5 0 0 1 2.72-2.41a4.92 4.92 0 0 1 3.28-.02a4.975 4.975 0 0 1 7.3-5.21a7.9 7.9 0 0 1 2.83-1.77a7.9 7.9 0 0 1 2.67-.48a5.9 5.9 0 0 1 2.03-1.23a6.003 6.003 0 0 1 7.69 3.58c.06.17.11.34.16.52q.285.047.56.14a3.95 3.95 0 0 1 2.53 2.42a4 4 0 0 1-2.39 5.12a3.94 3.94 0 0 1-2.91-.08a7.98 7.98 0 0 1-9.79 5.21a4.96 4.96 0 0 1-8.71 2.36a4.94 4.94 0 0 1-6.82 1.99a5.9 5.9 0 0 1-2.06 2.41M51 27h6v39h-6z"></path><path fill="#9b9b9a" d="M47 47.262a7.95 7.95 0 0 0-8.187 2.667c-1.111-7.296-1.17-15.131.384-19.929H33v36h14z"></path><path fill="#d0cfce" d="M33 66V30H16c3 9.257 0 29.829-5 36z"></path><path fill="#3f3f3f" d="M47 47.262V66h6V55a7.996 7.996 0 0 0-6-7.738"></path><path fill="#ea5a47" d="M51 31h6v4h-6z"></path><g fill="none" stroke="#000" strokeLinecap="round" strokeLinejoin="round" strokeWidth={2}><path d="M22.87 30c-.01 0-.02-.02-.02-.02a4.4 4.4 0 0 1-.52-.36c-.01-.01-.02-.01-.03-.02a6.1 6.1 0 0 1-1.83-2.6a6 6 0 0 1 3.16-7.51a3.977 3.977 0 0 1 6.76-2.13a5 5 0 0 1 2.72-2.41a4.92 4.92 0 0 1 3.28-.02a4.975 4.975 0 0 1 7.3-5.21a7.9 7.9 0 0 1 2.83-1.77a7.9 7.9 0 0 1 2.67-.48a5.9 5.9 0 0 1 2.03-1.23a6.003 6.003 0 0 1 7.69 3.58c.06.17.11.34.16.52q.285.047.56.14a3.95 3.95 0 0 1 2.53 2.42a4 4 0 0 1-2.39 5.12a3.94 3.94 0 0 1-2.91-.08a7.98 7.98 0 0 1-9.79 5.21a4.96 4.96 0 0 1-8.71 2.36a4.94 4.94 0 0 1-6.82 1.99a5.9 5.9 0 0 1-2.06 2.41M44.197 66c-5-6.171-8-26.743-5-36H16c3 9.257 0 29.829-5 36zM53 66h4V27h-6v22.721"></path><path d="M44.197 66H53V55a8 8 0 0 0-14.187-5.07"></path></g></svg>
function Services() {
    const theme = useTheme()
    return (
        <Section>
            <FlexRow sx={{ justifyContent: 'center', my: '12px' }} gap={'12px'}>
                <Typography variant='h3' textAlign={'center'}>
                    مميزات المنصه مع مستر وليد !
                </Typography>
                {/* <Image img={'/assets/paper-fly.png'} sx={{ maxWidth: '50px' }} /> */}
                {nuc}
            </FlexRow>

            {/* <FlexRow width={"150%"} justifyContent={'center'}>
                <Typography variant='banner' textAlign={'center'} ><span style={{ color: 'orange', }}>المنهج عندنا</span> و المذاكره عليك </Typography>
            </FlexRow> */}
            <FlexColumn>
                <Grid gap='50px'>
                    {features.map((f, i) => {
                        return <Paper key={i} elevation={3} sx={{ p: '16px', width: '100%', textAlign: 'center', bgcolor: theme.palette.primary.main + 20 }}>
                            <FlexColumn gap={'12px'} sx={{ width: '100%', height: '100%' }}>
                                {f.icon}
                                <Typography variant='h5' fontWeight={700} color={'primary.main'}>
                                    {f.title}
                                </Typography>
                                <Typography variant='body1'>
                                    {f.body}
                                </Typography>
                            </FlexColumn>
                        </Paper>
                    })}
                </Grid>
            </FlexColumn>

        </Section >
    )
}
//textDecorationLine: 'underline', textDecorationStyle: 'solid', textDecorationColor: 'red'
export default Services
